let pl1 = prompt('Введите камень, ножницы или бумага')
let things = ['камень', 'ножницы', 'бумага']
let pl2 = things[Math.floor(Math.random()*things.length)]
alert('Компьютер выбрал: ' + pl2)
if (pl1 === pl2) {
    alert("Ничья")
} 
else if (pl1 === 'камень' && pl2 === 'ножницы' || pl1 === 'ножницы' && pl2 === 'бумага' || pl1 === 'бумага' && pl2 === 'камень') {
    alert('Ты победил')
}
else if (pl1 === 'ножницы' && pl2 === 'камень' || pl1 === 'бумага' && pl2 === 'ножницы' || pl1 === 'камень' && pl2 === 'бумага') {
    alert('Ты проиграл')
}